function log(val, message) {
    if (message) console.log(message);
    console.log(JSON.stringify(val));
    return val;
  }
  
  

var app = angular.module('myApp', []);
  
app.controller('myCtrl', function($scope) {
  $scope.log = log;
  $scope.content = (function() {
    var twoDarray =
	[
      ['אֶת־חֻקֶּֽיךָ אֶשְׁמֹר',  'מָתַי אָבוֹא וְאֶרְאֶה',  'יַצֵּב גְּבוּל הַר־מוֹר',  'יִסַּח כָּל־בֵּית גֵּאֶה'],
      ['בְּבֹא כָל־יִשְׂרָאֵל',  'לֵרָאוֹת פְּנֵי אֲדוֹנָיו',  'וְיִהְיוּ צוֹבְאֵי אֲרִיאֵל',  'דּוֹר מְבַקְשֵׁי פָנָיו'],
      ['גְּדוֹר פִּרְצָתֵֽנוּ',  'מִבְצָרֵֽנוּ תְאַמֵּץ',  'סֵֽתֶר הֱוֵה־לָֽנוּ',  'כַּלֵּה שֹׁד וָמֵץ'],
      ['דּוֹבֲבִים בְּכָל־צַד',  'מְקַבְּלִים שְׁכַר דָּבָר',  'פָּרָשַׁת מֶֽלֶךְ כֵּיצַד',  'כְּאִלּוּ נַעֲשָׂה כְבָר'],
      ['הַקְהֵל מוֹצְאֵי יוֹם־טוֹב',  'מִקֵּץ שְׁנַת הַשְּׁמִטָּה',  'קְרִיאַת לֶֽקַח־טוֹב',  'בְּעֶזְרַת נָשִׁים לְמַֽטָּה'],
      ['וְכֹל פָּטוּר מֵרְאִיָּה',  'אֵינוֹ שׁוֹמֵֽעַ קְרִיאָה',  'לְבַד מֵאִשָּׁה רְאוּיָה',  'וְכָל־טַף בְּלִי טוּמְאָה'],
      ['זְמַנָּהּ כַּאֲשֶׁר הִגִּֽיעַ',  'בְּבִימַת עֵץ עוֹסְקִים',  'וְלֹא קֺֽדֶם שֶׁהִגִּֽיעַ',  'שֶׁלֹּא יְהוּ דְחוּקִים'],
      ['חַזַּן הַכְּנֶֽסֶת',  'נוֹטֵל בְּיָדוֹ תּוֹרָה',  'נוֹתֵן לְרֹאשׁ כְּנֶֽסֶת',  'לַרְבּוֹת בַּמֶּֽלֶךְ שְׂרָרָה'],
      ['טִלְטְלוֹ כֹהֵן שֵׁנִי',  'וְאַחֲרָיו כֹּהֵן הָרֹאשׁ',  'יִתֵּן חֶֽבֶר כְּתָבָֽנִי',  'לַמֶּֽלֶךְ, כֶּתֶר בָּרֹאשׁ'],
      ['יְקַבֵּל כְּשֶׁהוּא עוֹמֵד',  'בְּחִירָה לֵישֵׁב מִמֶּֽנּוּ',  'מְבָרֵךְ בְּבֺאוֹ לְלַמֵּד',  'אֲשֶׁר בָּֽחַר בָּֽנוּ'],
      ['כֵּֽפֶל תּוֹרָה מַתְחִיל',  'עַד סוֹף קְרִיאַת שְׁמַע',  'וְאֵת הָאָֽרֶץ תַּנְחִיל',  'אִם שָׁמֺֽעַ תִּשְׁמַע'],
      ['לְצָרֵף פַּרְשִׁיּוֹת מַעֲשֵׂר',  'בִּרְאֵה וּבְכִי תָבוֹא',  'שֹוֹם תָּשִׂים לְהָסֵר',  'אַף שֶׁבַּתָּֽוֶךְ מִכְתָּבוֹ'],
      ['מֶֽלֶךְ גּוֹמֵר אַזְהָרוֹת',  'בְּעִנְיַן בְּרָכוֹת וּקְלָלוֹת',  {content:'בְּרָכוֹת וְגַם תּוֹרוֹת', acrostic:2},  'בִּלְשׁוֹן־קֹֽדֶשׁ מְמֻלָּלוֹת'],
      ['נָטַע בְּתוֹכֵֽנוּ פּוֹצֶה',  'וּמִתְפַּלֵּל עַל עֲבוֹדוֹת',  'יִשְׂרָאֵל עַמְּךָ תִּרְצֶה',  'וּלְךָ נָאֶה לְהוֹדוֹת'],
      ['סוֹדֵר בִּרְכַּת הַמּוֹעֵד',  'וְשׁוֹאֵל אַחֲרֵי־כֵן',  'שְׁמֹר בֵּית מוֹעֵד',  'וְגוֹמֵר בְּצִיּוֹן שׁוֹכֵן'],
      ['עֺז תֵּן לְמַלְכוּתֶֽךָ',  'וְחוֹתֵם בּוֹחֵר בְּיִשְׂרָאֵל',  'רְצֵה שְׁלוּחֵי עֲבֺדָתֶֽךָ',  'מְבָרֲכֵי עַמְּךָ גּוֹאֵל'],
      ['פּוֹתֵֽחַ פִּיו בְּשַׁוְעָה',  'עַד תְּפִלָּתוֹ כִּלָּה',  'אֶת־עַמְּךָ הוֹשִֽׁיעָה',  'בָּרוּךְ שׁוֹמֵֽעַ תְּפִלָּה'],
      ['צֵאת שַׁבַּת הָאָֽרֶץ',  'לִקְבּֽוֹעַ יִרְאָה בְרוּרָה',  'לִשְׁמֽוֹעַ נִין פֶּֽרֶץ',  'כְּמוֹ מִפִּי גְבוּרָה'],
      ['קְשׁוֹב עֵת שַׁוְּעָם',  'כְּמוֹ הַקְטָרַת נָטָף',  'הַקְהֵל אֶת־הָעָם',  'הָאֲנָשִׁים וְהַנָּשִׁים וְהַטָּף'],
      ['רַחֵם עַל יִשְׂרָאֵל',  'כָּל־הָאֶזְרָח וְהַגֵּר',  'לָֽמָּה יֹאמְרוּ אַיֵּה־ ﭏֵ',  'גּוֹיִם אֲשֶׁר תְּמַגֵּר'],
      ['שִׂמְחַת עוֹלָם כַּתְּרֵם',  'פְּדוּיֶיךָ יְשׁוּבוּן',  'וְגַם סֻכָּתְךָ הָרֵם',  'בְּשֵׂיבָה עוֹד יְנוּבוּן'],
      ['תְּאֵבֵי יִשְׁעֲךָ קְנֵה',  'עֲנֵם גּֽוּשׁוּ הֲלֹם',  'יְרוּשָׁלִַם בְּנֵה',  'פְּרוֹשׂ עָלֶֽיהָ שָׁלוֹם']
    ];
    var result = [];
    angular.forEach(twoDarray, function(stanza, stanzaIndex){
      var newStanza = [];
      angular.forEach(stanza, function(bayith, bayithIndex){
        newStanza.push({
          content: angular.isString(bayith) ? bayith : bayith.content,
          acrostic: angular.isString(bayith) ? (bayithIndex % 2 == 0 ? 1 : 0) : bayith.acrostic
        });
      });
      result.push(newStanza);
    });
	return result;
  })();
  
  $scope.charRegex = /^([^\u05d0-\u05ea]*[\u05d0-\u05ea][^\u05d0-\u05ea]*)(.*)$/;
  
  $scope.letters = function(bayith, other) {
    var number = bayith.acrostic || 0;
    var text = bayith.content;
	if(number == 0){
      return other ? text: '';
    }
    return text.replace(
      new RegExp(
        '^([^\u05d0-\u05ea]*([\u05d0-\u05ea][^\u05d0-\u05ea]*){' + number + '})(.*)$'
      ),
      other ? '$3' : '$1'
    );
  }

});
